{"sections":{"faq_page_section_ayNFrU":{"type":"Faq-Page-Section","blocks":{"abouteddie_yEk6RB":{"type":"abouteddie","settings":{"abouteddie_heading":"What is Eddie?","abouteddie_content":"Eddie is a wearable FDA Class II medical device that works based on your natural physiology to keep you harder, for longer, without the common side effects that \n\t\t\t\t\t\t\t\t\t\t\t\toften come with ED medication."}},"abouteddie_bQcPBE":{"type":"abouteddie","settings":{"abouteddie_heading":"How do I use Eddie","abouteddie_content":"Place Eddie at the base of your penis (whether soft or hard), with the opening facing downward. Once your device is in place, apply a tension band to control constriction.\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tUsing lubricant during this process allows you to position Eddie more comfortably."}},"abouteddie_eqWnXj":{"type":"abouteddie","settings":{"abouteddie_heading":"Which tension band should I choose?","abouteddie_content":"You have two options. Use the blue band for a gentle touch or the red band for a tighter fit. You can also apply the tension band before putting on your device. Use a bit\n\t\t\t\t\t\t\t\t\t\t\t\tof lubricant first and then slide on your device."}},"abouteddie_nB3iDT":{"type":"abouteddie","settings":{"abouteddie_heading":"When do I wear my Eddie?","abouteddie_content":"Eddie can be worn before or during foreplay or during intercourse, whatever works best for you and your partner. We recommend testing Eddie solo to understand its feel \n\t\t\t\t\t\t\t\t\t\t\t\tand function before involving a partner."}},"abouteddie_8re48x":{"type":"abouteddie","settings":{"abouteddie_heading":"I have a medical condition that causes my ED. Will Eddie still work for me?","abouteddie_content":"You should always consult with your healthcare provider for professional advice. However, because Eddie does not involve medication, it has been effective for many men with \n\t\t\t\t\t\t\t\t\t\t\t\tmedical conditions that cause erectile dysfunction. Men with diabetes, low testosterone, heart disease, obesity, prostate cancer, depression, anxiety, PTSD and others \n\t\t\t\t\t\t\t\t\t\t\t\thave reported successful results with Eddie."}},"abouteddie_8WkbyM":{"type":"abouteddie","settings":{"abouteddie_heading":"Can I use Eddie with vacuum pumps and ED pills?","abouteddie_content":"Yes. However, Eddie is typically effective on its own. In some cases, combining Eddie with prescription medications, vacuum pumps, or other treatments may be necessary, \n\t\t\t\t\t\t\t\t\t\t\t\tas advised by your healthcare provider, to achieve erection."}},"abouteddie_iteiwN":{"type":"abouteddie","settings":{"abouteddie_heading":"Can I use lubricants with Eddie?","abouteddie_content":"Yes, Eddie can be used safely with any water-based, oil-based or silicone-based lubricant."}},"abouteddie_CHFGiH":{"type":"abouteddie","settings":{"abouteddie_heading":"How long can I wear Eddie?","abouteddie_content":"We recommend wearing the device for no longer than 30 minutes at a time and waiting 60 minutes in between uses. Refer to the instructions included with your device \n\t\t\t\t\t\t\t\t\t\t\t\tfor more information."}},"abouteddie_c4HxME":{"type":"abouteddie","settings":{"abouteddie_heading":"How do I clean my Eddie?","abouteddie_content":"To clean your device and tension bands, rinse them with warm water and later with a non-abrasive, antibacterial soap. Avoid harsh chemicals like bleach or chlorine. After\n\t\t\t\t\t\t\t\t\t\t\t\tcleaning it, allow your device to air dry or dry it yourself using a paper towel or a clean cloth towel."}},"sizing_4f3UiL":{"type":"sizing","settings":{"sizing_heading":"How do I find the right fit?","sizing_content":"See our size guide. We use two ways to determine which size you need. Either measure the base of your penis or choose it based on the condom size you've typically worn in \n\t\t\t\t\t\tthe past. If you experience frequent performance issues, consider a tighter fit."}},"sizing_4iXmdF":{"type":"sizing","settings":{"sizing_heading":"How do I measure the circumference of my penis?","sizing_content":"To ensure the best fit, wrap a soft measuring tape or string around the base of your penis while flaccid. Note the measurement and see our side guide for our recommendation."}},"sizing_ffNH4t":{"type":"sizing","settings":{"sizing_heading":"What if the device doesn't fit correctly?","sizing_content":"If the fit isn't right, reach out to us. While we don't accept returns on opened products, we'll gladly provide a \n\t\t\t\t\t\treplacement in a different size at no extra cost. Just contact our support team for assistance."}},"sizing_4JmjPe":{"type":"sizing","settings":{"sizing_heading":"How should it feel when I'm wearing it?","sizing_content":"Your device should feel snug but not uncomfortably so, like a firm handshake. We offer two \n\t\t\t\t\t\ttension band options for comfort and support. If the red band is too tight, try the blue one \n\t\t\t\t\t\tfor a gentler touch. Finding the right fit is crucial for effectiveness. Contact us if you \n\t\t\t\t\t\tneed help choosing the right option."}},"sizing_hMQ8wp":{"type":"sizing","settings":{"sizing_heading":"What if I resize and it still doesn't work?","sizing_content":"If resizing doesn't solve the issue, we offer a 30-day money back guarantee. <a class=\"faq-anchor\" href=\"\/pages\/contact\"> Contact our support \n\t\t\t\t\t\tteam <\/a> for assistance with returns and refunds."}},"sizing_WpJ8Dq":{"type":"sizing","settings":{"sizing_heading":"Still have questions?","sizing_content":"Feel free to <a class=\"faq-anchor\" href=\"\/pages\/contact\"> contact our dedicated customer support \n\t\t\t\t\t\tteam <\/a> for any further inquiries. We're here to help ensure your experience with our product is as \n\t\t\t\t\t\tseamless as possible."}},"subscription_w6xXKR":{"type":"subscription","settings":{"subscription_heading":"Is Eddie a subscription plan?","subscription_content":"Yes. Every four months we replace your device and accessories so that your product always works\n\t\t\t\t\t\tlike new. Your account will be charged automatically every 4 months and your device will ship \n\t\t\t\t\t\tfor free within 5-7 business days of the renewal."}},"subscription_BmXLJa":{"type":"subscription","settings":{"subscription_heading":"What are the benefits of the subscription plan?","subscription_content":"The subscription plan ensures you always have a fresh device and set of tension bands, ensuring \n\t\t\t\t\t\thygiene and optimal performance. Regular replacement of your device and bands helps maintain \n\t\t\t\t\t\teffectiveness and ensures you're always ready when you need it."}},"subscription_wDMAy4":{"type":"subscription","settings":{"subscription_heading":"How do I cancel or modify my subscription?","subscription_content":"Log into your account at any time to manage your subscription plan, including the choice to \n\t\t\t\t\t\tdefer your next shipment. You can update your address and payment information, and check the \n\t\t\t\t\t\tstatus of new deliveries. You may cancel or defer at any time. We do not charge a cancellation fee.\n\t\t\t\t\t\t<br><br>\n\t\t\t\t\t\tThe lifespan of Eddie varies based on usage—how often you use it, and how effectively you \n\t\t\t\t\t\tclean and store it. You should also replace your device when switching partners or if you've \n\t\t\t\t\t\trecently been treated for a sexually transmitted infection (STI). The majority of users replace \n\t\t\t\t\t\tEddie within 3-4 months."}},"billing_8Q3eBm":{"type":"billing","settings":{"billing_heading":"Do you ship to where I live?","billing_content":"Eddie can be shipped to anywhere in the United States."}},"billing_cJnGAy":{"type":"billing","settings":{"billing_heading":"What is your shipping process?","billing_content":"We ship your order for free using USPS First Class on the same day. For even faster delivery,\n\t\t\t\t\t\tyou can choose to upgrade to USPS Priority for a fee. Once shipped, we'll email you the tracking details \n\t\t\t\t\t\tso you can monitor your delivery on the USPS website."}},"billing_zQyENr":{"type":"billing","settings":{"billing_heading":"Are there other locations where I can purchase Eddie?","billing_content":"Eddie is also available online at <a class=\"faq-anchor\" href=\"https:\/\/www.amazon.com\/Eddie-Giddy-Expert-Designed-Body-Adaptive-FDA-Registered\/dp\/B08JSSKRTH\/\"> Amazon <\/a> and Rite Aid"}},"billing_EXqGaT":{"type":"billing","settings":{"billing_heading":"How can I contact you?","billing_content":"Our primary form of customer support is via email. <a class=\"faq-anchor\" href=\"\/pages\/contact\"> Click here to Email our Customer Support Team. <\/a>"}},"billing_69Yw9Q":{"type":"billing","settings":{"billing_heading":"What payment methods can I use?","billing_content":"We accept Visa, Master Card, American Express, Discover, Elo, UnionPay, JCB and Diners Club, as well as PayPal. \n\t\t\t\t\t\tAll transactions are secure and encrypted."}},"about_ed_Ftf3BY":{"type":"aboutED","settings":{"aboutED_heading":"What is ED?","aboutED_content":"Erectile dysfunction (ED) occurs when a man is unable to achieve or sustain an erection\n\t\t\t\t\t\tthat is sufficient for sexual intercourse. This condition can be caused by various factors\n\t\t\t\t\t\tincluding mental health issues, physical health problems and lifestyle choices.\n\t\t\t\t\t\t<br><br>\n\t\t\t\t\t\tSome common causes include heart disease, diabetes, stress, anxiety, depression, \n\t\t\t\t\t\texcessive alcohol consumption, tobacco use, and certain medications.\n\t\t\t\t\t\t<br><br>\n\t\t\t\t\t\tIf you're wondering whether or not you have ED, we recommend that you \n\t\t\t\t\t\ttake our <a class=\"faq-anchor\" href=\"https:\/\/lander.eddiebygiddy.com\/?utm_medium=eddiesite&amp;utm_source=faq&amp;utm_content=user%20clicked%20faq%20link\"> Quiz. <\/a>"}},"about_ed_aMcQte":{"type":"aboutED","settings":{"aboutED_heading":"How common is ED?","aboutED_content":"More than 45 million men in the United States experience ED every year due to a wide \n\t\t\t\t\t\tvariety of factors. ED is more prevalent for older men, although age alone is not \n\t\t\t\t\t\tnecessarily responsible for the condition. Many older men maintain healthy erectile \n\t\t\t\t\t\tfunction, while some younger men may experience ED due to factors such as stress, \n\t\t\t\t\t\tlifestyle choices, or underlying health conditions."}},"about_ed_XR7WGi":{"type":"aboutED","settings":{"aboutED_heading":"How do I know if I have ED?","aboutED_content":"If you're not able to consistently get and maintain an erection when you want to have \n\t\t\t\t\t\tsex, you may have ED, a condition that can be caused by a number of physical or \n\t\t\t\t\t\tpsychological issues, even medication and lifestyle choices. Here are some of the most \n\t\t\t\t\t\tcommon symptoms:\n\t\t\t\t\t\t<br><br>\n\t\t\t\t\t\t- Having trouble getting an erection\t\t<br>\n\t\t\t\t\t\t- Having trouble maintaining an erection \t<br>\n\t\t\t\t\t\t- Getting erections that aren’t as full as you need them to be <br><br>\t\t\t\t\t\t\n\t\t\t\t\t\tIf you're wondering whether or not you have ED, we recommend that you \n\t\t\t\t\t\ttake our <a class=\"faq-anchor\" href=\"https:\/\/lander.eddiebygiddy.com\/?utm_medium=eddiesite&amp;utm_source=faq&amp;utm_content=user%20clicked%20faq%20link\"> Quiz. <\/a>"}},"about_ed_LAPRyh":{"type":"aboutED","settings":{"aboutED_heading":"What is the science behind erections?","aboutED_content":"Sexual arousal causes the brain to send chemical signals to the blood vessels in the penis, causing them to \n\t\t\t\t\t\trelax and allow more blood to flow in. This increased blood flow fills the twin chambers called corpora cavernosa, \n\t\t\t\t\t\tmaking the penis rigid and erect."}},"about_ed_eGFAiK":{"type":"aboutED","settings":{"aboutED_heading":"Can Eddie help improve sexual performance?","aboutED_content":"Yes, Eddie can help you maintain a strong erection during foreplay and intercourse. \n\t\t\t\t\t\t<br><br>\n\t\t\t\t\t\tEddie won't give you an erection by itself, so you should speak to a healthcare provider for \n\t\t\t\t\t\tmedical advice if you have a severe case of ED. Treatment may also involve addressing lifestyle \n\t\t\t\t\t\tfactors, such as improving diet and exercise habits."}},"about_ed_NXDyL9":{"type":"aboutED","settings":{"aboutED_heading":"Are there clinical trials for ED treatment?","aboutED_content":"Yes, there are ongoing clinical trials aimed at developing new treatments for ED. If you're \n\t\t\t\t\t\tinterested in participating in a clinical trial, you can find more information at the website \n\t\t\t\t\t\tfor the National Institutes of Health."}}},"block_order":["abouteddie_yEk6RB","abouteddie_bQcPBE","abouteddie_eqWnXj","abouteddie_nB3iDT","abouteddie_8re48x","abouteddie_8WkbyM","abouteddie_iteiwN","abouteddie_CHFGiH","abouteddie_c4HxME","sizing_4f3UiL","sizing_4iXmdF","sizing_ffNH4t","sizing_4JmjPe","sizing_hMQ8wp","sizing_WpJ8Dq","subscription_w6xXKR","subscription_BmXLJa","subscription_wDMAy4","billing_8Q3eBm","billing_cJnGAy","billing_zQyENr","billing_EXqGaT","billing_69Yw9Q","about_ed_Ftf3BY","about_ed_aMcQte","about_ed_XR7WGi","about_ed_LAPRyh","about_ed_eGFAiK","about_ed_NXDyL9"],"settings":{"faq_heading":"Frequently Asked Questions","about_eddie_heading":"About Eddie","sizing_heading":"Sizing","subscription_heading":"Subscription","billing_heading":"Billing & Customer Service","about_ED_heading":"About ED"}}},"order":["faq_page_section_ayNFrU"]}